-- 주석
-- : SQL 문법이 아닌 설명을 덧붙이거나, 메모를 작성하고 싶은 경우
-- 단축키 : ctrl + /

-- 글자 크기 변경
-- : ctrl + 마우스 스크롤 위 / 아래

-- 이것은 SQL 문법이 아닙니다.

-- 주석 표현 방법
-- 한 줄 주석
-- 하이폰(-) 2개 사용 후 띄어쓰기 한 칸
# 샵(#) 1개 사용후 띄어쓰기 한 칸

-- 여러 줄 주석
/*
	슬래시 사이에 별기호 2개 사용
    해당 주석 사이의 문장은
    모두 SQL 리더기에서 읽히지 않음.
    
    여러 문장을 작성해도
    여러 줄 모두 주석으로 인식
*/

-- 2. 글자 크기 변경
-- : ctrl + 마우스 스크롤 위 / 아래
-- Edit > Preferces > font & color 앞에는 폰트 뒤에는 글자크기

-- 3. SQL 명령어 세팅(대문자 / 소문자)
-- 대소문자 구분 X (Show = sHOW)
-- Edit > Format > UPCASE Keywords(대문자 시작시 명령어 작동) / LOWCASE Keywords(소문자 시작시 명령어 작동)


-- SQL 유용한 단축키
-- 파일저장 : CTRL + S
-- 한 줄 복사 : CTRL + D
-- 한 줄 삭제 : CTRL + L
/* 실행 단축키 : 마우스 커서가 위치하는 쿼리문을 실행 CTRL + ENTER
			  마우스 드래그한 영역을 쿼리문을 실행 CTRL + SHIFT + ENTER
*/


